Revit 2025 API
BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData Property
 The original model contains unsupported geometric data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
Public Shared ReadOnly Property ATFContainedUnsupportedGeometricData As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ATFContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
static member ATFContainedUnsupportedGeometricData : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace